In [1]:
import pandas as pd
import numpy as np

# SERIES

In [2]:
# Series-- 1-d array object which contains sequence of value and an associated array of data labels called index

In [6]:
ser = pd.Series(['a','b','c','d'])

In [9]:
ser

0    a
1    b
2    c
3    d
dtype: object

In [10]:
# series with predefined index

In [11]:
ser1 = pd.Series([8,4,6,9], index= ['a','b','c','d'])

In [12]:
ser1

a    8
b    4
c    6
d    9
dtype: int64

In [13]:
# selection of values with the help of index

In [14]:
ser1['a']

8

In [15]:
ser1[['a','d']]

a    8
d    9
dtype: int64

In [16]:
# filtering with boolean array

In [17]:
ser1[ser1>3]

a    8
b    4
c    6
d    9
dtype: int64

In [18]:
ser1[ser1<=8]

a    8
b    4
c    6
dtype: int64

In [19]:
# Scalar Multiplication

In [20]:
ser1*2

a    16
b     8
c    12
d    18
dtype: int64

In [21]:
# Mathematical Function implication on series

In [22]:
np.exp(ser1)

a    2980.957987
b      54.598150
c     403.428793
d    8103.083928
dtype: float64

In [23]:
np.log(ser1)

a    2.079442
b    1.386294
c    1.791759
d    2.197225
dtype: float64

In [24]:
# value check with the help of in operator

In [25]:
'b' in ser1

True

In [26]:
'e' in ser1

False

In [27]:
8 in ser1   # compatible with index value

False

In [28]:
2 in ser   # as this series has numeric index value

True

In [31]:
# Creating Series with Dictionary

In [32]:
data = {'Name': 'Raj', 'key2': 20}

In [33]:
ser2 = pd.Series(data)

In [34]:
ser2

Name    Raj
key2     20
dtype: object

In [35]:
# overwriting of index in existing series

In [36]:
student=['Name','Age','Qual']   # one or more values should be identical

In [37]:
ser2= pd.Series(data, index=student)

In [38]:
ser2

Name    Raj
Age     NaN
Qual    NaN
dtype: object

In [39]:
# isnull() and notnull()

In [40]:
pd.isnull(ser2)

Name    False
Age      True
Qual     True
dtype: bool

In [41]:
pd.notnull(ser2)

Name     True
Age     False
Qual    False
dtype: bool

In [42]:
# arithmatic operation

In [44]:
sdata = {'Hyd': 35000, 'Tel': 71000, 'Bih': 16000, 'Up': 5000}

In [45]:
obj = pd.Series(sdata)

In [46]:
obj

Hyd    35000
Tel    71000
Bih    16000
Up      5000
dtype: int64

In [49]:
states = ['WB', 'Hyd', 'Blore', 'Tel']

In [41]:
obj1 = pd.Series(sdata, index=states)

In [47]:
obj1

WB           NaN
Hyd      35000.0
Blore        NaN
Tel      71000.0
Name: state_pop, dtype: float64

In [42]:
obj+obj1

Bih           NaN
Blore         NaN
Hyd       70000.0
Tel      142000.0
Up            NaN
WB            NaN
dtype: float64

In [43]:
# assigning name to series

In [44]:
obj1.name= 'state_pop'

In [45]:
obj1

WB           NaN
Hyd      35000.0
Blore        NaN
Tel      71000.0
Name: state_pop, dtype: float64

In [92]:
# assigning name to index

In [62]:
obj1.index.name = 'States'

In [63]:
obj1

States
Bihar         NaN
Punjab    35000.0
UP            NaN
MP        71000.0
Name: state_pop, dtype: float64

In [59]:
# index alteration by assignment

In [60]:
obj1.index = ['Bihar','Punjab','UP','MP']

In [64]:
obj1

States
Bihar         NaN
Punjab    35000.0
UP            NaN
MP        71000.0
Name: state_pop, dtype: float64

In [65]:
# Droping entries from axis in Series

In [66]:
obj2= pd.Series(np.arange(6), index=list('abcdef'))

In [67]:
obj2

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [68]:
new_obj = obj2.drop('b')

In [69]:
new_obj

a    0
c    2
d    3
e    4
f    5
dtype: int32

In [72]:
obj2.drop(['d','f'])

a    0
b    1
c    2
e    4
dtype: int32

In [73]:
obj2

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [74]:
# Indexing, Slicing and Filtering with Series

In [75]:
obj2['e']  #indexing

4

In [76]:
obj2[2:4]  # Slicing

c    2
d    3
dtype: int32

In [77]:
obj2[['b','e']]   #indexing

b    1
e    4
dtype: int32

In [78]:
obj2[[1,3]]     #indexing

b    1
d    3
dtype: int32

In [79]:
obj2['b':'e']   # Slicing with labels

b    1
c    2
d    3
e    4
dtype: int32

In [80]:
obj2[obj2<3]   #  Filtering

a    0
b    1
c    2
dtype: int32

In [81]:
# modifying values

In [82]:
obj2['b':'c'] = 5

In [83]:
obj2

a    0
b    5
c    5
d    3
e    4
f    5
dtype: int32

# DataFrame

In [84]:
# Dataframe -- a group of series, where each series contains a column of data

In [86]:
# Dataframe from dictionary

In [87]:
data = {'name':['Raj','Mohan','Ramesh','Pinky'],
         'age':[20,21,25,19],
          'qual':['Grad','Engg','BSc','Bcom']}

In [88]:
df = pd.DataFrame(data)

In [89]:
df

     name  age  qual
0     Raj   20  Grad
1   Mohan   21  Engg
2  Ramesh   25   BSc
3   Pinky   19  Bcom

In [90]:
# manipulation over column position

In [91]:
pd.DataFrame(data, columns=['age','name','qual'])

   age    name  qual
0   20     Raj  Grad
1   21   Mohan  Engg
2   25  Ramesh   BSc
3   19   Pinky  Bcom

In [92]:
df

     name  age  qual
0     Raj   20  Grad
1   Mohan   21  Engg
2  Ramesh   25   BSc
3   Pinky   19  Bcom

In [93]:
df1= pd.DataFrame(data, columns=['age','name','qual'])

In [94]:
df1

   age    name  qual
0   20     Raj  Grad
1   21   Mohan  Engg
2   25  Ramesh   BSc
3   19   Pinky  Bcom

In [95]:
# if you pass column name more than the value in dictionry

In [96]:
df2 = pd.DataFrame(data, columns=['name','age','qual','married'])

In [97]:
df2

     name  age  qual married
0     Raj   20  Grad     NaN
1   Mohan   21  Engg     NaN
2  Ramesh   25   BSc     NaN
3   Pinky   19  Bcom     NaN

In [98]:
# to check columns in dataframe

In [99]:
df2.columns

Index(['name', 'age', 'qual', 'married'], dtype='object')

In [113]:
# to retrive column attribute

In [64]:
df2['age']    #index method

0    20
1    21
2    25
3    19
Name: age, dtype: int64

In [66]:
df2.age   # direct method

0    20
1    21
2    25
3    19
Name: age, dtype: int64

In [118]:
# based on label i.e loc

In [67]:
df2.loc[1]  #index value is provided here

name       Mohan
age           21
qual        Engg
married      NaN
Name: 1, dtype: object

In [68]:
df2.loc[:,['age','name']]  # all rows along with age and name column

   age    name
0   20     Raj
1   21   Mohan
2   25  Ramesh
3   19   Pinky

In [69]:
df2.loc[:,'age']

0    20
1    21
2    25
3    19
Name: age, dtype: int64

In [70]:
df2.loc[[1,3]]

    name  age  qual married
1  Mohan   21  Engg     NaN
3  Pinky   19  Bcom     NaN

In [71]:
df.loc[[1,3],['age','name']]

   age   name
1   21  Mohan
3   19  Pinky

In [125]:
# based on position i.e iloc

In [72]:
df2.iloc[0:2,1:3]

   age  qual
0   20  Grad
1   21  Engg

In [74]:
df2.iloc[:,[3,1]]

  married  age
0     NaN   20
1     NaN   21
2     NaN   25
3     NaN   19

In [75]:
df2.iloc[[1,3],:]

    name  age  qual married
1  Mohan   21  Engg     NaN
3  Pinky   19  Bcom     NaN

In [76]:
df2.iloc[[0,2],[0,3]]

     name married
0     Raj     NaN
2  Ramesh     NaN

In [135]:
# column modification with assignment

In [77]:
df2['married'] = 'No'

In [78]:
df2

     name  age  qual married
0     Raj   20  Grad      No
1   Mohan   21  Engg      No
2  Ramesh   25   BSc      No
3   Pinky   19  Bcom      No

In [100]:
df2['income']= 200

In [101]:
df2

     name  age  qual married  income
0     Raj   20  Grad     NaN     200
1   Mohan   21  Engg     NaN     200
2  Ramesh   25   BSc     NaN     200
3   Pinky   19  Bcom     NaN     200

In [81]:
df2['profession']=['Intern','Student','Student','Intern']

In [82]:
df2

     name  age  qual married  income profession
0     Raj   20  Grad      No     200     Intern
1   Mohan   21  Engg      No     200    Student
2  Ramesh   25   BSc      No     200    Student
3   Pinky   19  Bcom      No     200     Intern

In [143]:
# deletion of column from dataframe

In [83]:
del df2['income']

In [84]:
df2

     name  age  qual married profession
0     Raj   20  Grad      No     Intern
1   Mohan   21  Engg      No    Student
2  Ramesh   25   BSc      No    Student
3   Pinky   19  Bcom      No     Intern

In [146]:
# Dictionary Creation with nested Dictionary

In [85]:
data = {'Pune':{2001:4, 2002:9},
         'Hyd':{2000:5,2001:7,2002:3}}

In [86]:
df3 = pd.DataFrame(data)   #outer key-- column  #inner key--index

In [87]:
df3

      Pune  Hyd
2000   NaN    5
2001   4.0    7
2002   9.0    3

In [153]:
# Transpose

In [88]:
df3.T

      2000  2001  2002
Pune   NaN   4.0   9.0
Hyd    5.0   7.0   3.0

In [155]:
# Index name

In [89]:
df3.index.name = 'Year'

In [157]:
# Column Name

In [90]:
df3.columns.name = 'City'

In [91]:
df3

City  Pune  Hyd
Year
2000   NaN    5
2001   4.0    7
2002   9.0    3

In [160]:
# to check  values

In [92]:
df3.values

array([[nan,  5.],
       [ 4.,  7.],
       [ 9.,  3.]])

In [93]:
df3['Pune'].unique

<bound method Series.unique of Year
2000    NaN
2001    4.0
2002    9.0
Name: Pune, dtype: float64>

In [94]:
df3['Hyd'].unique()

array([5, 7, 3], dtype=int64)

# Reindexing

In [164]:
# Reindexing-- create a new object with the data conformed(adoption) to a new index

In [165]:
# Reindexing with Series

In [103]:
a = pd.Series([1,2,3,4], index= list('abcd'))

In [104]:
a_rindex = a.reindex(list('acdeb'))

In [105]:
a

a    1
b    2
c    3
d    4
dtype: int64

In [106]:
a_rindex

a    1.0
c    3.0
d    4.0
e    NaN
b    2.0
dtype: float64

In [107]:
 #for ordered data, like time series, we can do interpolation i.e filling of values when reindeing.
 #we can do this by method -- ffill and bfill

In [108]:
colour = pd.Series(['red','blue','green'], index=[0,2,4])

In [109]:
colour1 = pd.Series(['red','blue','green'], index=[0,2,4])

In [110]:
colour

0      red
2     blue
4    green
dtype: object

In [111]:
# ffill

In [102]:
colour = colour.reindex(range(6),method='ffill')

In [103]:
colour

0      red
1      red
2     blue
3     blue
4    green
5    green
dtype: object

In [105]:
colour1 = colour1.reindex(range(6), method='bfill')

In [106]:
colour1

0      red
1     blue
2     blue
3    green
4    green
5      NaN
dtype: object

In [143]:
# Reindexing with DataFrame

In [150]:
# in dataframe reindexing can alter either index or column or both

In [48]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index= list('acb'),columns= ['Hyd','Pune','Blore'])

In [49]:
df

   Hyd  Pune  Blore
a    0     1      2
c    3     4      5
b    6     7      8

In [50]:
df1= df.reindex(list('abdc'))  # when only one sequence is pass it reindex the row/index

In [51]:
df1

   Hyd  Pune  Blore
a  0.0   1.0    2.0
b  6.0   7.0    8.0
d  NaN   NaN    NaN
c  3.0   4.0    5.0

In [52]:
city = ['Hyd','Mumbai','Pune']

In [53]:
df2 = df.reindex(columns=city)   # columns can be reindex with columns keyword

In [54]:
df2

   Hyd  Mumbai  Pune
a    0     NaN     1
c    3     NaN     4
b    6     NaN     7

In [57]:
df3= df.reindex(list('abdc'), columns=city)

In [56]:
df3

   Hyd  Mumbai  Pune
a  0.0     NaN   1.0
b  6.0     NaN   7.0
d  NaN     NaN   NaN
c  3.0     NaN   4.0

In [173]:
# we can do reindexing by label indexing i.e by loc

In [174]:
df4 = df.loc[['a','d','b','c'], city]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

In [175]:
df4

   Hyd  Mumbai  Pune
a  0.0     NaN   1.0
d  NaN     NaN   NaN
b  6.0     NaN   7.0
c  3.0     NaN   4.0

In [176]:
# Droping entries from Axis with DataFrame

In [206]:
df = pd.DataFrame(np.arange(16).reshape(4,4), index= list('abcd'), columns = ['Hyd','Pune','Blore','Kolkata'])

In [207]:
df

   Hyd  Pune  Blore  Kolkata
a    0     1      2        3
b    4     5      6        7
c    8     9     10       11
d   12    13     14       15

In [208]:
df.drop('c')    # dropping by index value

   Hyd  Pune  Blore  Kolkata
a    0     1      2        3
b    4     5      6        7
d   12    13     14       15

In [209]:
df.drop('Blore', axis =1)    # dropping by columns

   Hyd  Pune  Kolkata
a    0     1        3
b    4     5        7
c    8     9       11
d   12    13       15

In [210]:
df

   Hyd  Pune  Blore  Kolkata
a    0     1      2        3
b    4     5      6        7
c    8     9     10       11
d   12    13     14       15

In [211]:
df.drop('Blore', axis =1, inplace = True)

In [213]:
df

   Hyd  Pune  Kolkata
a    0     1        3
b    4     5        7
c    8     9       11
d   12    13       15

In [214]:
# Indexing, Selection and Filtering with Dataframe

In [219]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = list('abcd'), columns = ['one','two','three','four'])

In [220]:
data

   one  two  three  four
a    0    1      2     3
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15

In [216]:
data['two']     #indexing

a     1
b     5
c     9
d    13
Name: two, dtype: int32

In [134]:
data[:2]     #slicing

   one  two  three  four
a    0    1      2     3
b    4    5      6     7

In [135]:
data[data['three']>5]     # Filtering

   one  two  three  four
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15

In [136]:
data <5     #Boolean DataFrame

     one    two  three   four
a   True   True   True   True
b   True  False  False  False
c  False  False  False  False
d  False  False  False  False

In [137]:
data[data<5] = 0     #assinging values with boolean

In [138]:
data

   one  two  three  four
a    0    0      0     0
b    0    5      6     7
c    8    9     10    11
d   12   13     14    15

# Integer Index

In [227]:
ser = pd.Series(np.arange(4)

In [228]:
ser

0    0
1    1
2    2
3    3
dtype: int32

In [229]:
ser[1]

1

In [230]:
ser[-1]

KeyError: -1

In [231]:
ser[:2]

0    0
1    1
dtype: int32

In [232]:
ser.loc[:2]

0    0
1    1
2    2
dtype: int32

In [233]:
ser.iloc[-1]

3

In [234]:
ser.iloc[-3:-1]

1    1
2    2
dtype: int32

In [235]:
ser2 = pd.Series(np.arange(4), index=list('abcd'))

In [236]:
ser2[-1]

3

# Arithmetic and Data Alignment

In [237]:
# with Series

In [238]:
s1 = pd.Series(np.arange(3), index = list('abc'))
s2 = pd.Series(np.arange(5), index = ['a','c','e','f','g'])

In [239]:
s1

a    0
b    1
c    2
dtype: int32

In [240]:
s2

a    0
c    1
e    2
f    3
g    4
dtype: int32

In [241]:
s1+s2

a    0.0
b    NaN
c    3.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [242]:
# with dataframe

In [243]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), columns = list('bcd'), index = ['one','two','three'])
df2 = pd.DataFrame(np.arange(12).reshape(4,3), columns = list('bde'), index = ['one','two','three','four'])

In [244]:
df1

       b  c  d
one    0  1  2
two    3  4  5
three  6  7  8

In [245]:
df2

       b   d   e
one    0   1   2
two    3   4   5
three  6   7   8
four   9  10  11

In [246]:
df1+df2

          b   c     d   e
four    NaN NaN   NaN NaN
one     0.0 NaN   3.0 NaN
three  12.0 NaN  15.0 NaN
two     6.0 NaN   9.0 NaN

In [251]:
df3 = pd.DataFrame({'A':[1,2]})
df4 = pd.DataFrame({'B':[3,4]})

In [252]:
df3

   A
0  1
1  2

In [253]:
df4

   B
0  3
1  4

In [254]:
df3+df4

    A   B
0 NaN NaN
1 NaN NaN

In [255]:
# Arithmetic method with fill value

In [263]:
df5 = pd.DataFrame(np.arange(12).reshape(3,4), columns = list('bcde'))
df6 = pd.DataFrame(np.arange(20).reshape(4,5), columns = list('bdefc'))

In [268]:
df5

   b  c   d   e
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [269]:
df6.loc[1,'b'] = np.nan

In [270]:
df6

      b   d   e   f   c
0   0.0   1   2   3   4
1   NaN   6   7   8   9
2  10.0  11  12  13  14
3  15.0  16  17  18  19

In [272]:
df5+df6

      b     c     d     e   f
0   0.0   5.0   3.0   5.0 NaN
1   NaN  14.0  12.0  14.0 NaN
2  18.0  23.0  21.0  23.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [281]:
df5.add(df6, fill_value=0)

      b     c     d     e     f
0   0.0   5.0   3.0   5.0   3.0
1   4.0  14.0  12.0  14.0   8.0
2  18.0  23.0  21.0  23.0  13.0
3  15.0  19.0  16.0  17.0  18.0

# Operation Between DataFrame and Series

In [289]:
df6 = pd.DataFrame(np.arange(12).reshape(4,3), columns= list('abc'), index = ['one','two','three','four'])

In [290]:
df6

       a   b   c
one    0   1   2
two    3   4   5
three  6   7   8
four   9  10  11

In [291]:
series = df6.iloc[0]    # complete one row value

In [292]:
series

a    0
b    1
c    2
Name: one, dtype: int32

In [294]:
df6-series   # broadcasting down the rows as index value matches

       a  b  c
one    0  0  0
two    3  3  3
three  6  6  6
four   9  9  9

In [295]:
series2 = pd.Series(range(3), index=list('afc'))  # if index value of series and column value of dataframe didn't match, object will be reindexed to form union

In [297]:
df6+series2

         a   b     c   f
one    0.0 NaN   4.0 NaN
two    3.0 NaN   7.0 NaN
three  6.0 NaN  10.0 NaN
four   9.0 NaN  13.0 NaN

In [298]:
# Broadcasting over Column

In [299]:
series3 = df6['b']

In [300]:
series3    # complete one column value

one       1
two       4
three     7
four     10
Name: b, dtype: int32

In [301]:
df6.sub(series3, axis=0)

       a  b  c
one   -1  0  1
two   -1  0  1
three -1  0  1
four  -1  0  1

# Function Application and Mapping

In [354]:
df7 = pd.DataFrame(np.random.randn(4,3), columns=list('bde'), index = ['one','two','three','four'])

In [355]:
df7

              b         d         e
one    1.074729  0.455725 -0.953612
two    0.774075  0.436389 -0.209345
three  0.359639 -0.128803 -0.315929
four  -0.309022 -0.959264  1.000338

In [356]:
cols = ['b', 'd' , 'e']

In [357]:
df7[cols] = df7[cols].applymap(np.int64)

In [361]:
df7

       b  d  e
one    1  0  0
two    0  0  0
three  0  0  0
four   0  0  1

In [366]:
df7['b'] = df7.b.astype(float)

In [367]:
df7

         b  d  e
one    1.0  0  0
two    0.0  0  0
three  0.0  0  0
four   0.0  0  1

In [368]:
# Absolute Function

In [369]:
np.abs(df7)

         b    d    e
one    1.0  0.0  0.0
two    0.0  0.0  0.0
three  0.0  0.0  0.0
four   0.0  0.0  1.0

In [370]:
# applying function on one dimensional array to each columns or row

In [371]:
f= lambda x: x.max()-x.min()

In [372]:
df7.apply(f)

b    1.0
d    0.0
e    1.0
dtype: float64

In [373]:
df7.apply(f, axis= 1)

one      1.0
two      0.0
three    0.0
four     1.0
dtype: float64

In [ ]:
def f(x):
    return pd.Series([x.min(),x.max()], index = ['min','max'])
df7.apply(f)                                                      # Series with multiple values

In [343]:
# Element wise Python function
d= lambda x: '%.2f'%x

In [344]:
df7.applymap(d)

           b     d      e
one    -0.46  0.48  -0.36
two     1.34  0.25  -0.43
three  -0.14  0.44   0.25
four   -1.76  1.33   1.05

In [345]:
df7['e'].map(d)

one      -0.36
two      -0.43
three     0.25
four      1.05
Name: e, dtype: object

In [346]:
def add_2(val):
    return val+2
df7.apply(add_2)

              b         d         e
one    1.544531  2.478915  1.637137
two    3.341031  2.246940  1.574351
three  1.858887  2.440196  2.247699
four   0.236503  3.326647  3.053170

# Sorting and Ranking

In [ ]:
# sorting series with index

In [ ]:
obj = pd.Series( range(4), index=list('bdac'))

In [ ]:
obj

In [ ]:
obj.sort_index()

In [ ]:
# sorting series with values

In [ ]:
obj1 = pd.Series([4,-8,7,-1])

In [ ]:
obj1.sort_values()

In [ ]:
obj2 = pd.Series([4,-8,7,np.nan,-1, np.nan])

In [ ]:
obj2.sort_values()

In [ ]:
# Ranking in series

In [ ]:
obj3 = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj3.rank()

In [ ]:
obj3.rank(method = 'first')

In [ ]:
# sorting dataframe with index

In [ ]:
df8 = pd.DataFrame(np.arange(16).reshape(4,4), index = ['two','four','one','three'], columns = list('dabc'))

In [ ]:
df8

In [ ]:
df8.sort_index()

In [ ]:
df8.sort_index(axis=1)

In [ ]:
# sorting dataframe with values

In [ ]:
df9 = pd.DataFrame({'b':[4,3],'a':[-9,11]})

In [ ]:
df9

In [ ]:
df9.sort_values(by='b')

In [ ]:
df9.sort_values(by=['a','b'])

In [ ]:
df9.sort_values(by=['b','a'])

In [ ]:
# Ranking in Dataframe

In [ ]:
data = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [ ]:
data

In [ ]:
data.rank(axis=1)

In [ ]:
data.rank()

In [ ]:
data.rank(method='first', axis = 1)

# Summarizing and Computing Descriptive Statistics

In [325]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]], index = list('abcd'), columns= ['one','two'])

In [326]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [327]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [328]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [329]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [330]:
df.idxmax()

one    b
two    d
dtype: object

In [331]:
df.idxmin()

one    d
two    b
dtype: object

In [332]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

# Membership

In [ ]:
# isin -- it performs a vectorize set membership check, useful in filtering a database down to a subject of values in a Series
# or columns in DataFrame

In [379]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [380]:
mask = obj.isin(['b','c'])

In [381]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [319]:
data1 = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]}, index = list('abcde'))

In [320]:
data1

   Qu1  Qu2  Qu3
a    1    2    1
b    3    3    5
c    4    1    2
d    3    2    4
e    4    3    4

In [321]:
mask = data1.isin([3,2])

In [322]:
data1[mask]

   Qu1  Qu2  Qu3
a  NaN  2.0  NaN
b  3.0  3.0  NaN
c  NaN  NaN  2.0
d  3.0  2.0  NaN
e  NaN  3.0  NaN

In [323]:
mask1 = data1.isin([4])

In [324]:
data1[mask1]

   Qu1  Qu2  Qu3
a  NaN  NaN  NaN
b  NaN  NaN  NaN
c  4.0  NaN  NaN
d  NaN  NaN  4.0
e  4.0  NaN  4.0